import os
import datetime
import sys, os
sys.path.append(os.path.dirname(os.path.dirname(__file__)))
import requests
from datetime import datetime, timedelta
import time

def download_off_pred(start_ymd: str, jcd:str, days: int = 1, interval_sec: int = 1, kind: str = "beforeinfo"):

    base_url = f"https://boatrace.jp/owpc/pc/race/{kind}?jcd={jcd}"
    current_date = datetime.strptime(start_ymd, "%Y%m%d")

    for i in range(days):
        target_ymd = current_date.strftime("%Y%m%d")
        print(target_ymd)
        target_url = f"{base_url}&hd={target_ymd}"
        for j in range(1, 13):
            target_url_no = f"{target_url}&rno={j}"
            print(f"▶ 取得中: {target_url_no} ...")
            try:
                response = requests.get(target_url_no, timeout=(5, 30))
                if response.status_code == 200 and "<html" in response.text.lower():
                    file_name = f"{kind}_{jcd}_{target_ymd}_{j}.html"
                    dir_name = f"download/{jcd}_off_{kind}_pred_html"
                    if not os.path.exists(dir_name):
                        os.makedirs(dir_name)
                    file_path = os.path.join(dir_name, file_name)
                    with open(file_path, "w", encoding="utf-8") as f:
                        f.write(response.text)
                    print(f"✅ 成功: {file_name} を保存しました。")
                else:
                    print(f"⚠️ 失敗: ステータスコード {response.status_code} または HTML未検出")

            except requests.RequestException as e:
                print(f"❌ エラー: {e}")
            # 次の日へ
        current_date += timedelta(days=1)

if __name__ == "__main__":
    dates = [
  '20250101','20250102','20250103','20250106','20250107','20250108','20250109','20250111','20250112','20250113','20250114','20250115','20250116','20250121','20250122','20250123','20250124','20250125','20250126','20250131',
  '20250201','20250202','20250203','20250210','20250211','20250212','20250213','20250214','20250215','20250221','20250222','20250223','20250224','20250225',
  '20250302','20250303','20250304','20250305','20250307','20250308','20250309','20250310','20250311','20250329','20250330','20250331',
  '20250401','20250405','20250406','20250407','20250408','20250409','20250410','20250426','20250427','20250428','20250429','20250430',
  '20250507','20250508','20250509','20250510','20250511','20250512','20250513','20250515','20250516','20250517','20250518','20250519','20250521','20250522','20250523','20250524','20250525','20250529','20250530','20250531',
  '20250601','20250602','20250603','20250613','20250614','20250615','20250616','20250623','20250624','20250625','20250626','20250627',
  '20250701','20250702','20250703','20250704','20250705','20250706','20250710','20250711','20250712','20250713','20250714','20250717','20250718','20250719','20250720','20250727','20250728','20250729','20250730','20250731',
  '20250810','20250811','20250812','20250813','20250814','20250815','20250821','20250822','20250823','20250824','20250830','20250831',
  '20250901','20250902','20250904','20250905','20250906','20250907','20250910','20250911','20250912','20250913','20250914','20250915','20250916','20250920','20250921','20250922','20250923','20250924','20250929','20250930',
  '20251001','20251002','20251003','20251004','20251011','20251012','20251013','20251014','20251028','20251029','20251030','20251031',
  '20251101','20251102','20251109','20251110','20251111','20251112','20251113','20251114','20251119','20251120','20251121','20251122','20251123','20251124'
]

    # 先頭
    for d in dates:
        download_off_pred(start_ymd=d, jcd="19", days=1, interval_sec=1, kind="beforeinfo")